Andydingbing/SPC5/rd/chip/reg_def_lmx2594.h
#ifndef INCLUDE_REG_DEF_LMX2594_H
#define INCLUDE_REG_DEF_LMX2594_H

#include "reg_def.h"

#define LMX2594_REG_DECL(addr,init) REG_DECL_INIT(ns_reg_lmx2594,addr,init)
#define LMX2594_REG_DATA(addr) REG_DATA(ns_reg_lmx2594,addr)
#define LMX2594_REG(addr) REG(ns_reg_lmx2594,addr)	

#define LMX2594_REG_DECL_0x00 LMX2594_REG_DECL(0x00,0x251C)
#define LMX2594_REG_DECL_0x01 LMX2594_REG_DECL(0x01,0x0808)
#define LMX2594_REG_DECL_0x02 LMX2594_REG_DECL(0x02,0x0500)
#define LMX2594_REG_DECL_0x03 LMX2594_REG_DECL(0x03,0x0642)
#define LMX2594_REG_DECL_0x04 LMX2594_REG_DECL(0x04,0x0A43)
#define LMX2594_REG_DECL_0x05 LMX2594_REG_DECL(0x05,0x00C8)
#define LMX2594_REG_DECL_0x06 LMX2594_REG_DECL(0x06,0xC802)
#define LMX2594_REG_DECL_0x07 LMX2594_REG_DECL(0x07,0x40B2)
#define LMX2594_REG_DECL_0x08 LMX2594_REG_DECL(0x08,0x2000)
#define LMX2594_REG_DECL_0x09 LMX2594_REG_DECL(0x09,0x1604)
#define LMX2594_REG_DECL_0x0a LMX2594_REG_DECL(0x0a,0x10D8)
#define LMX2594_REG_DECL_0x0b LMX2594_REG_DECL(0x0b,0x0018)
#define LMX2594_REG_DECL_0x0c LMX2594_REG_DECL(0x0c,0x5001)
#define LMX2594_REG_DECL_0x0d LMX2594_REG_DECL(0x0d,0x4000)
#define LMX2594_REG_DECL_0x0e LMX2594_REG_DECL(0x0e,0x1E70)
#define LMX2594_REG_DECL_0x0f LMX2594_REG_DECL(0x0f,0x064F)
#define LMX2594_REG_DECL_0x10 LMX2594_REG_DECL(0x10,0x0080)
#define LMX2594_REG_DECL_0x11 LMX2594_REG_DECL(0x11,0x0118)
#define LMX2594_REG_DECL_0x12 LMX2594_REG_DECL(0x12,0x0064)
#define LMX2594_REG_DECL_0x13 LMX2594_REG_DECL(0x13,0x27B7)
#define LMX2594_REG_DECL_0x14 LMX2594_REG_DECL(0x14,0xF848)
#define LMX2594_REG_DECL_0x15 LMX2594_REG_DECL(0x15,0x0401)
#define LMX2594_REG_DECL_0x16 LMX2594_REG_DECL(0x16,0x0001)
#define LMX2594_REG_DECL_0x17 LMX2594_REG_DECL(0x17,0x007C)
#define LMX2594_REG_DECL_0x18 LMX2594_REG_DECL(0x18,0x071A)
#define LMX2594_REG_DECL_0x19 LMX2594_REG_DECL(0x19,0x0C2B)
#define LMX2594_REG_DECL_0x1a LMX2594_REG_DECL(0x1a,0x0DB0)
#define LMX2594_REG_DECL_0x1b LMX2594_REG_DECL(0x1b,0x0002)
#define LMX2594_REG_DECL_0x1c LMX2594_REG_DECL(0x1c,0x0488)
#define LMX2594_REG_DECL_0x1d LMX2594_REG_DECL(0x1d,0x318C)
#define LMX2594_REG_DECL_0x1e LMX2594_REG_DECL(0x1e,0x318C)
#define LMX2594_REG_DECL_0x1f LMX2594_REG_DECL(0x1f,0x43EC)
#define LMX2594_REG_DECL_0x20 LMX2594_REG_DECL(0x20,0x0393)
#define LMX2594_REG_DECL_0x21 LMX2594_REG_DECL(0x21,0x1E21)
#define LMX2594_REG_DECL_0x22 LMX2594_REG_DECL(0x22,0x0000)
#define LMX2594_REG_DECL_0x23 LMX2594_REG_DECL(0x23,0x0004)
#define LMX2594_REG_DECL_0x24 LMX2594_REG_DECL(0x24,0x0048)
#define LMX2594_REG_DECL_0x25 LMX2594_REG_DECL(0x25,0x0404)
#define LMX2594_REG_DECL_0x26 LMX2594_REG_DECL(0x26,0x0000)
#define LMX2594_REG_DECL_0x27 LMX2594_REG_DECL(0x27,0x03E8)
#define LMX2594_REG_DECL_0x28 LMX2594_REG_DECL(0x28,0x0000)
#define LMX2594_REG_DECL_0x29 LMX2594_REG_DECL(0x29,0x0000)
#define LMX2594_REG_DECL_0x2a LMX2594_REG_DECL(0x2a,0x0000)
#define LMX2594_REG_DECL_0x2b LMX2594_REG_DECL(0x2b,0x01F4)
#define LMX2594_REG_DECL_0x2c LMX2594_REG_DECL(0x2c,0x1FA3)
#define LMX2594_REG_DECL_0x2d LMX2594_REG_DECL(0x2d,0xC8DF)
#define LMX2594_REG_DECL_0x2e LMX2594_REG_DECL(0x2e,0x07FC)
#define LMX2594_REG_DECL_0x2f LMX2594_REG_DECL(0x2f,0x0300)
#define LMX2594_REG_DECL_0x30 LMX2594_REG_DECL(0x30,0x0300)
#define LMX2594_REG_DECL_0x31 LMX2594_REG_DECL(0x31,0x4180)
#define LMX2594_REG_DECL_0x32 LMX2594_REG_DECL(0x32,0x0000)
#define LMX2594_REG_DECL_0x33 LMX2594_REG_DECL(0x33,0x0080)
#define LMX2594_REG_DECL_0x34 LMX2594_REG_DECL(0x34,0x0820)
#define LMX2594_REG_DECL_0x35 LMX2594_REG_DECL(0x35,0x0000)
#define LMX2594_REG_DECL_0x36 LMX2594_REG_DECL(0x36,0x0000)
#define LMX2594_REG_DECL_0x37 LMX2594_REG_DECL(0x37,0x0000)
#define LMX2594_REG_DECL_0x38 LMX2594_REG_DECL(0x38,0x0000)
#define LMX2594_REG_DECL_0x39 LMX2594_REG_DECL(0x39,0x0020)
#define LMX2594_REG_DECL_0x3a LMX2594_REG_DECL(0x3a,0x9001)
#define LMX2594_REG_DECL_0x3b LMX2594_REG_DECL(0x3b,0x0001)
#define LMX2594_REG_DECL_0x3c LMX2594_REG_DECL(0x3c,0x0000)
#define LMX2594_REG_DECL_0x3d LMX2594_REG_DECL(0x3d,0x00A8)
#define LMX2594_REG_DECL_0x3e LMX2594_REG_DECL(0x3e,0x0322)
#define LMX2594_REG_DECL_0x3f LMX2594_REG_DECL(0x3f,0x0000)
#define LMX2594_REG_DECL_0x40 LMX2594_REG_DECL(0x40,0x1388)
#define LMX2594_REG_DECL_0x41 LMX2594_REG_DECL(0x41,0x0000)
#define LMX2594_REG_DECL_0x42 LMX2594_REG_DECL(0x42,0x01F4)
#define LMX2594_REG_DECL_0x43 LMX2594_REG_DECL(0x43,0x0000)
#define LMX2594_REG_DECL_0x44 LMX2594_REG_DECL(0x44,0x03E8)
#define LMX2594_REG_DECL_0x45 LMX2594_REG_DECL(0x45,0x0000)
#define LMX2594_REG_DECL_0x46 LMX2594_REG_DECL(0x46,0xC350)
#define LMX2594_REG_DECL_0x47 LMX2594_REG_DECL(0x47,0x0081)
#define LMX2594_REG_DECL_0x48 LMX2594_REG_DECL(0x48,0x0001)
#define LMX2594_REG_DECL_0x49 LMX2594_REG_DECL(0x49,0x003F)
#define LMX2594_REG_DECL_0x4a LMX2594_REG_DECL(0x4a,0x0000)
#define LMX2594_REG_DECL_0x4b LMX2594_REG_DECL(0x4b,0x0800)
#define LMX2594_REG_DECL_0x4c LMX2594_REG_DECL(0x4c,0x000C)
#define LMX2594_REG_DECL_0x4d LMX2594_REG_DECL(0x4d,0x0000)
#define LMX2594_REG_DECL_0x4e LMX2594_REG_DECL(0x4e,0x00B5)
#define LMX2594_REG_DECL_0x4f LMX2594_REG_DECL(0x4f,0x0000)
#define LMX2594_REG_DECL_0x50 LMX2594_REG_DECL(0x50,0x0000)
#define LMX2594_REG_DECL_0x51 LMX2594_REG_DECL(0x51,0x0000)
#define LMX2594_REG_DECL_0x52 LMX2594_REG_DECL(0x52,0x0000)
#define LMX2594_REG_DECL_0x53 LMX2594_REG_DECL(0x53,0x0000)
#define LMX2594_REG_DECL_0x54 LMX2594_REG_DECL(0x54,0x0000)
#define LMX2594_REG_DECL_0x55 LMX2594_REG_DECL(0x55,0x0000)
#define LMX2594_REG_DECL_0x56 LMX2594_REG_DECL(0x56,0x0000)
#define LMX2594_REG_DECL_0x57 LMX2594_REG_DECL(0x57,0x0000)
#define LMX2594_REG_DECL_0x58 LMX2594_REG_DECL(0x58,0x0000)
#define LMX2594_REG_DECL_0x59 LMX2594_REG_DECL(0x59,0x0000)
#define LMX2594_REG_DECL_0x5a LMX2594_REG_DECL(0x5a,0x0000)
#define LMX2594_REG_DECL_0x5b LMX2594_REG_DECL(0x5b,0x0000)
#define LMX2594_REG_DECL_0x5c LMX2594_REG_DECL(0x5c,0x0000)
#define LMX2594_REG_DECL_0x5d LMX2594_REG_DECL(0x5d,0x0000)
#define LMX2594_REG_DECL_0x5e LMX2594_REG_DECL(0x5e,0x0000)
#define LMX2594_REG_DECL_0x5f LMX2594_REG_DECL(0x5f,0x0000)
#define LMX2594_REG_DECL_0x60 LMX2594_REG_DECL(0x60,0x0000)
#define LMX2594_REG_DECL_0x61 LMX2594_REG_DECL(0x61,0x0888)
#define LMX2594_REG_DECL_0x62 LMX2594_REG_DECL(0x62,0x0000)
#define LMX2594_REG_DECL_0x63 LMX2594_REG_DECL(0x63,0x0000)
#define LMX2594_REG_DECL_0x64 LMX2594_REG_DECL(0x64,0x0000)
#define LMX2594_REG_DECL_0x65 LMX2594_REG_DECL(0x65,0x0011)
#define LMX2594_REG_DECL_0x66 LMX2594_REG_DECL(0x66,0x0000)
#define LMX2594_REG_DECL_0x67 LMX2594_REG_DECL(0x67,0x0000)
#define LMX2594_REG_DECL_0x68 LMX2594_REG_DECL(0x68,0x0000)
#define LMX2594_REG_DECL_0x69 LMX2594_REG_DECL(0x69,0x0021)
#define LMX2594_REG_DECL_0x6a LMX2594_REG_DECL(0x6a,0x0000)
#define LMX2594_REG_DECL_0x6b LMX2594_REG_DECL(0x6b,0x0000)
#define LMX2594_REG_DECL_0x6c LMX2594_REG_DECL(0x6c,0x0000)
#define LMX2594_REG_DECL_0x6d LMX2594_REG_DECL(0x6d,0x0000)
#define LMX2594_REG_DECL_0x6e LMX2594_REG_DECL(0x6e,0x0000)
#define LMX2594_REG_DECL_0x6f LMX2594_REG_DECL(0x6f,0x0000)
#define LMX2594_REG_DECL_0x70 LMX2594_REG_DECL(0x70,0x0000)

