Andydingbing/SPC5/rd/chip/reg_def_lmx2594.h
#define LMX2594_ALL_REG_DECL  \
    LMX2594_REG_DECL_0x00 \
    LMX2594_REG_DECL_0x01 \
    LMX2594_REG_DECL_0x02 \
    LMX2594_REG_DECL_0x03 \
    LMX2594_REG_DECL_0x04 \
    LMX2594_REG_DECL_0x05 \
    LMX2594_REG_DECL_0x06 \
    LMX2594_REG_DECL_0x07 \
    LMX2594_REG_DECL_0x08 \
    LMX2594_REG_DECL_0x09 \
    LMX2594_REG_DECL_0x0a \
    LMX2594_REG_DECL_0x0b \
    LMX2594_REG_DECL_0x0c \
    LMX2594_REG_DECL_0x0d \
    LMX2594_REG_DECL_0x0e \
    LMX2594_REG_DECL_0x0f \
    LMX2594_REG_DECL_0x10 \
    LMX2594_REG_DECL_0x11 \
    LMX2594_REG_DECL_0x12 \
    LMX2594_REG_DECL_0x13 \
    LMX2594_REG_DECL_0x14 \
    LMX2594_REG_DECL_0x15 \
    LMX2594_REG_DECL_0x16 \
    LMX2594_REG_DECL_0x17 \
    LMX2594_REG_DECL_0x18 \
    LMX2594_REG_DECL_0x19 \
    LMX2594_REG_DECL_0x1a \
    LMX2594_REG_DECL_0x1b \
    LMX2594_REG_DECL_0x1c \
    LMX2594_REG_DECL_0x1d \
    LMX2594_REG_DECL_0x1e \
    LMX2594_REG_DECL_0x1f \
    LMX2594_REG_DECL_0x20 \
    LMX2594_REG_DECL_0x21 \
    LMX2594_REG_DECL_0x22 \
    LMX2594_REG_DECL_0x23 \
    LMX2594_REG_DECL_0x24 \
    LMX2594_REG_DECL_0x25 \
    LMX2594_REG_DECL_0x26 \
    LMX2594_REG_DECL_0x27 \
    LMX2594_REG_DECL_0x28 \
    LMX2594_REG_DECL_0x29 \
    LMX2594_REG_DECL_0x2a \
    LMX2594_REG_DECL_0x2b \
    LMX2594_REG_DECL_0x2c \
    LMX2594_REG_DECL_0x2d \
    LMX2594_REG_DECL_0x2e \
    LMX2594_REG_DECL_0x2f \
    LMX2594_REG_DECL_0x30 \
    LMX2594_REG_DECL_0x31 \
    LMX2594_REG_DECL_0x32 \
    LMX2594_REG_DECL_0x33 \
    LMX2594_REG_DECL_0x34 \
    LMX2594_REG_DECL_0x35 \
    LMX2594_REG_DECL_0x36 \
    LMX2594_REG_DECL_0x37 \
    LMX2594_REG_DECL_0x38 \
    LMX2594_REG_DECL_0x39 \
    LMX2594_REG_DECL_0x3a \
    LMX2594_REG_DECL_0x3b \
    LMX2594_REG_DECL_0x3c \
    LMX2594_REG_DECL_0x3d \
    LMX2594_REG_DECL_0x3e \
    LMX2594_REG_DECL_0x3f \
    LMX2594_REG_DECL_0x40 \
    LMX2594_REG_DECL_0x41 \
    LMX2594_REG_DECL_0x42 \
    LMX2594_REG_DECL_0x43 \
    LMX2594_REG_DECL_0x44 \
    LMX2594_REG_DECL_0x45 \
    LMX2594_REG_DECL_0x46 \
    LMX2594_REG_DECL_0x47 \
    LMX2594_REG_DECL_0x48 \
    LMX2594_REG_DECL_0x49 \
    LMX2594_REG_DECL_0x4a \
    LMX2594_REG_DECL_0x4b \
    LMX2594_REG_DECL_0x4c \
    LMX2594_REG_DECL_0x4d \
    LMX2594_REG_DECL_0x4e \
    LMX2594_REG_DECL_0x4f \
    LMX2594_REG_DECL_0x50 \
    LMX2594_REG_DECL_0x51 \
    LMX2594_REG_DECL_0x52 \
    LMX2594_REG_DECL_0x53 \
    LMX2594_REG_DECL_0x54 \
    LMX2594_REG_DECL_0x55 \
    LMX2594_REG_DECL_0x56 \
    LMX2594_REG_DECL_0x57 \
    LMX2594_REG_DECL_0x58 \
    LMX2594_REG_DECL_0x59 \
    LMX2594_REG_DECL_0x5a \
    LMX2594_REG_DECL_0x5b \
    LMX2594_REG_DECL_0x5c \
    LMX2594_REG_DECL_0x5d \
    LMX2594_REG_DECL_0x5e \
    LMX2594_REG_DECL_0x5f \
    LMX2594_REG_DECL_0x60 \
    LMX2594_REG_DECL_0x61 \
    LMX2594_REG_DECL_0x62 \
    LMX2594_REG_DECL_0x63 \
    LMX2594_REG_DECL_0x64 \
    LMX2594_REG_DECL_0x65 \
    LMX2594_REG_DECL_0x66 \
    LMX2594_REG_DECL_0x67 \
    LMX2594_REG_DECL_0x68 \
    LMX2594_REG_DECL_0x69 \
    LMX2594_REG_DECL_0x6a \
    LMX2594_REG_DECL_0x6b \
    LMX2594_REG_DECL_0x6c \
    LMX2594_REG_DECL_0x6d \
    LMX2594_REG_DECL_0x6e \
    LMX2594_REG_DECL_0x6f \
    LMX2594_REG_DECL_0x70

#define LMX2594_ALL_REG_ARRAY_DECL(array) \
    LMX2594_ALL_REG_DECL; \
    uint16_t array[0x71] = { \
    LMX2594_REG_DATA(0x00), \
    LMX2594_REG_DATA(0x01), \
    LMX2594_REG_DATA(0x02), \
    LMX2594_REG_DATA(0x03), \
    LMX2594_REG_DATA(0x04), \
    LMX2594_REG_DATA(0x05), \
    LMX2594_REG_DATA(0x06), \
    LMX2594_REG_DATA(0x07), \
    LMX2594_REG_DATA(0x08), \
    LMX2594_REG_DATA(0x09), \
    LMX2594_REG_DATA(0x0a), \
    LMX2594_REG_DATA(0x0b), \
    LMX2594_REG_DATA(0x0c), \
    LMX2594_REG_DATA(0x0d), \
    LMX2594_REG_DATA(0x0e), \
    LMX2594_REG_DATA(0x0f), \
    LMX2594_REG_DATA(0x10), \
    LMX2594_REG_DATA(0x11), \
    LMX2594_REG_DATA(0x12), \
    LMX2594_REG_DATA(0x13), \
    LMX2594_REG_DATA(0x14), \
    LMX2594_REG_DATA(0x15), \
    LMX2594_REG_DATA(0x16), \
    LMX2594_REG_DATA(0x17), \
    LMX2594_REG_DATA(0x18), \
    LMX2594_REG_DATA(0x19), \
    LMX2594_REG_DATA(0x1a), \
    LMX2594_REG_DATA(0x1b), \
    LMX2594_REG_DATA(0x1c), \
    LMX2594_REG_DATA(0x1d), \
    LMX2594_REG_DATA(0x1e), \
    LMX2594_REG_DATA(0x1f), \
    LMX2594_REG_DATA(0x20), \
    LMX2594_REG_DATA(0x21), \
    LMX2594_REG_DATA(0x22), \
    LMX2594_REG_DATA(0x23), \
    LMX2594_REG_DATA(0x24), \
    LMX2594_REG_DATA(0x25), \
    LMX2594_REG_DATA(0x26), \
    LMX2594_REG_DATA(0x27), \
    LMX2594_REG_DATA(0x28), \
    LMX2594_REG_DATA(0x29), \
    LMX2594_REG_DATA(0x2a), \
    LMX2594_REG_DATA(0x2b), \
    LMX2594_REG_DATA(0x2c), \
    LMX2594_REG_DATA(0x2d), \
    LMX2594_REG_DATA(0x2e), \
    LMX2594_REG_DATA(0x2f), \
    LMX2594_REG_DATA(0x30), \
    LMX2594_REG_DATA(0x31), \
    LMX2594_REG_DATA(0x32), \
    LMX2594_REG_DATA(0x33), \
    LMX2594_REG_DATA(0x34), \
    LMX2594_REG_DATA(0x35), \
    LMX2594_REG_DATA(0x36), \
    LMX2594_REG_DATA(0x37), \
    LMX2594_REG_DATA(0x38), \
    LMX2594_REG_DATA(0x39), \
    LMX2594_REG_DATA(0x3a), \
    LMX2594_REG_DATA(0x3b), \
    LMX2594_REG_DATA(0x3c), \
    LMX2594_REG_DATA(0x3d), \
    LMX2594_REG_DATA(0x3e), \
    LMX2594_REG_DATA(0x3f), \
    LMX2594_REG_DATA(0x40), \
    LMX2594_REG_DATA(0x41), \
    LMX2594_REG_DATA(0x42), \
    LMX2594_REG_DATA(0x43), \
    LMX2594_REG_DATA(0x44), \
    LMX2594_REG_DATA(0x45), \
    LMX2594_REG_DATA(0x46), \
    LMX2594_REG_DATA(0x47), \
    LMX2594_REG_DATA(0x48), \
    LMX2594_REG_DATA(0x49), \
    LMX2594_REG_DATA(0x4a), \
    LMX2594_REG_DATA(0x4b), \
    LMX2594_REG_DATA(0x4c), \
    LMX2594_REG_DATA(0x4d), \
    LMX2594_REG_DATA(0x4e), \
    LMX2594_REG_DATA(0x4f), \
    LMX2594_REG_DATA(0x50), \
    LMX2594_REG_DATA(0x51), \
    LMX2594_REG_DATA(0x52), \
    LMX2594_REG_DATA(0x53), \
    LMX2594_REG_DATA(0x54), \
    LMX2594_REG_DATA(0x55), \
    LMX2594_REG_DATA(0x56), \
    LMX2594_REG_DATA(0x57), \
    LMX2594_REG_DATA(0x58), \
    LMX2594_REG_DATA(0x59), \
    LMX2594_REG_DATA(0x5a), \
    LMX2594_REG_DATA(0x5b), \
    LMX2594_REG_DATA(0x5c), \
    LMX2594_REG_DATA(0x5d), \
    LMX2594_REG_DATA(0x5e), \
    LMX2594_REG_DATA(0x5f), \
    LMX2594_REG_DATA(0x60), \
    LMX2594_REG_DATA(0x61), \
    LMX2594_REG_DATA(0x62), \
    LMX2594_REG_DATA(0x63), \
    LMX2594_REG_DATA(0x64), \
    LMX2594_REG_DATA(0x65), \
    LMX2594_REG_DATA(0x66), \
    LMX2594_REG_DATA(0x67), \
    LMX2594_REG_DATA(0x68), \
    LMX2594_REG_DATA(0x69), \
    LMX2594_REG_DATA(0x6a), \
    LMX2594_REG_DATA(0x6b), \
    LMX2594_REG_DATA(0x6c), \
    LMX2594_REG_DATA(0x6d), \
    LMX2594_REG_DATA(0x6e), \
    LMX2594_REG_DATA(0x6f), \
    LMX2594_REG_DATA(0x70) };

namespace ns_reg_lmx2594 {

REG_DEF_CPT_PREFIX_16(0x00)
    unsigned pwr_down : 1;
    unsigned reset : 1;
    unsigned muxout_ld_sel : 1;
    unsigned en_fcal : 1;
    unsigned rsv0 : 1;
    unsigned fcal_lpfd_adj : 2;
    unsigned fcal_hpfd_adj : 2;
    unsigned out_mute : 1;
    unsigned rsv1 : 4;
    unsigned vco_phase_sync : 1;
    unsigned en_ramp : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x01)
    unsigned cal_clk_div : 3;
    unsigned rsv0 : 13;
REG_DEF_CPT_SUFFIX_16

