Andydingbing/SPC5/rd/chip/reg_def_lmx2594.h
REG_DEF_CPT_PREFIX_16(0x02)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x03)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x04)
    unsigned rsv0 : 8;
    unsigned acal_cmp_dly : 8;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x05)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x06)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x07)
    unsigned rsv0 : 14;
    unsigned out_force : 1;
    unsigned rsv1 : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x08)
    unsigned rsv0 : 11;
    unsigned vco_capctrl_force : 1;
    unsigned rsv1 : 2;
    unsigned vco_daciset_force : 1;
    unsigned rsv2 : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x09)
    unsigned rsv0 : 12;
    unsigned osc_2x : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x0a)
    unsigned rsv0 : 7;
    unsigned mult : 5;
    unsigned rsv1 : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x0b)
    unsigned rsv0 : 4;
    unsigned pll_r : 8;
    unsigned rsv1 : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x0c)
    unsigned pll_r_pre : 12;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x0d)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x0e)
    unsigned rsv0 : 4;
    unsigned cpg : 3;
    unsigned rsv1 : 9;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x0f)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x10)
    unsigned vco_daciset : 9;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x11)
    unsigned vco_daciset_strt : 9;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x12)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x13)
    unsigned vco_capctrl : 8;
    unsigned rsv0 : 8;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x14)
    unsigned rsv0 : 10;
    unsigned vco_sel_force : 1;
    unsigned vco_sel : 3;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x15)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x16)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x17)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x18)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x19)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x1a)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x1b)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x1c)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x1d)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x1e)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x1f)
    unsigned rsv0 : 14;
    unsigned chdiv_div2 : 1;
    unsigned rsv1 : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x20)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x21)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x22)
    unsigned pll_n : 3;
    unsigned rsv0 : 13;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x23)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x24)
    unsigned pll_n : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x25)
    unsigned rsv0 : 8;
    unsigned pfd_dly_sel : 6;
    unsigned rsv1 : 1;
    unsigned en_mash_seed : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x26)
    unsigned pll_den : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x27)
    unsigned pll_den : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x28)
    unsigned mash_seed : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x29)
    unsigned mash_seed : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2a)
    unsigned pll_num : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2b)
    unsigned pll_num : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2c)
    unsigned mash_order : 3;
    unsigned rsv0 : 2;
    unsigned mash_reset_n : 1;
    unsigned outa_pd : 1;
    unsigned outb_pd : 1;
    unsigned outa_pwr : 6;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2d)
    unsigned outb_pwr : 6;
    unsigned rsv0 : 3;
    unsigned out_iset : 2;
    unsigned outa_mux : 2;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2e)
    unsigned outb_mux : 2;
    unsigned rsv0 : 14;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x2f)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x30)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x31)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x32)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x33)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x34)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x35)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x36)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x37)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x38)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x39)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3a)
    unsigned rsv0 : 9;
    unsigned inpin_fmt : 3;
    unsigned inpin_lvl : 2;
    unsigned inpin_hyst : 1;
    unsigned inpin_ignore : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3b)
    unsigned ld_type : 1;
    unsigned rsv0 : 15;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3c)
    unsigned ld_dly : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3d)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3e)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x3f)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x40)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x41)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x42)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x43)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x44)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x45)
    unsigned mash_rst_cnt : 16;
REG_DEF_CPT_SUFFIX_16

