Andydingbing/SPC5/rd/chip/reg_def_lmx2594.h
REG_DEF_CPT_PREFIX_16(0x46)
    unsigned mash_rst_cnt : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x47)
    unsigned rsv0 : 2;
    unsigned sysref_repeat : 1;
    unsigned en_sysref : 1;
    unsigned sysref_pulse : 1;
    unsigned sysref_div_pre : 3;
    unsigned rsv1 : 8;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x48)
    unsigned sysref_div : 11;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x49)
    unsigned jesd_dac1_ctrl : 6;
    unsigned jesd_dac2_ctrl : 6;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4a)
    unsigned jesd_dac3_ctrl : 6;
    unsigned jesd_dac4_ctrl : 6;
    unsigned sysref_pulse_cnt : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4b)
    unsigned rsv0 : 6;
    unsigned chdiv : 5;
    unsigned rsv1 : 5;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4c)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4d)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4e)
    unsigned rsv0 : 1;
    unsigned vco_capctrl_strt : 8;
    unsigned en_quick_recal : 1;
    unsigned rsv1 : 1;
    unsigned ramp_thresh : 1;
    unsigned rsv2 : 4;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x4f)
    unsigned ramp_thresh : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x50)
    unsigned ramp_thresh : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x51)
    unsigned ramp_limit_high : 1;
    unsigned rsv0 : 15;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x52)
    unsigned ramp_limit_high : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x53)
    unsigned ramp_limit_high : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x54)
    unsigned ramp_limit_low : 1;
    unsigned rsv0 : 15;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x55)
    unsigned ramp_limit_low : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x56)
    unsigned ramp_limit_low : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x57)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x58)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x59)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5a)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5b)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5c)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5d)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5e)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x5f)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x60)
    unsigned rsv0 : 2;
    unsigned ramp_burst_cnt : 13;
    unsigned en_ramp_burst : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x61)
    unsigned ramp_burst_trig : 2;
    unsigned rsv0 : 1;
    unsigned ramp_triga : 4;
    unsigned ramp_trigb : 4;
    unsigned rsv1 : 4;
    unsigned ramp0_rst : 1;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x62)
    unsigned ramp0_dly : 1;
    unsigned rsv0 : 1;
    unsigned ramp0_inc : 14;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x63)
    unsigned ramp0_inc : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x64)
    unsigned ramp0_len : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x65)
    unsigned ramp0_next_trig : 2;
    unsigned rsv0 : 2;
    unsigned ramp0_next : 1;
    unsigned ramp1_rst : 1;
    unsigned ramp1_dly : 1;
    unsigned rsv1 : 9;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x66)
    unsigned ramp1_inc : 14;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x67)
    unsigned ramp1_inc : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x68)
    unsigned ramp1_len : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x69)
    unsigned ramp1_next_trig : 2;
    unsigned rsv0 : 2;
    unsigned ramp1_next : 1;
    unsigned ramp_manual : 1;
    unsigned ramp_dly_cnt : 10;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x6a)
    unsigned ramp_scal_cnt : 3;
    unsigned rsv0 : 1;
    unsigned ramp_trig_cal : 1;
    unsigned rsv1 : 11;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x6b)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x6c)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x6d)
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x6e)
    unsigned rsv0 : 5;
    unsigned rb_vco_sel : 3;
    unsigned rsv1 : 1;
    unsigned rb_ld_vtune : 2;
    unsigned rsv2 : 5;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x6f)
    unsigned rb_vco_capctrl : 8;
    unsigned rsv0 : 8;
REG_DEF_CPT_SUFFIX_16

REG_DEF_CPT_PREFIX_16(0x70)
    unsigned rb_vco_daciset : 9;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_16

} // ns_reg_lmx2594

#endif // INCLUDE_REG_DEF_LMX2594_H
